01  WS-AREA. 
    05  WS-COUNT PIC 9(5) VALUE 0. 
    05  WS-COUNT-STR PIC X(5). 
    05  WS-TABLE OCCURS 100 TIMES. 
       10  WS-ITEM PIC X(25). 

       PROCEDURE DIVISION. 
           PERFORM VARYING WS-COUNT FROM 1 BY 1 UNTIL WS-COUNT > 100 
               MOVE WS-COUNT TO WS-COUNT-STR 
               STRING "RECORD" DELIMITED BY SIZE WS-COUNT-STR DELIMITED BY SIZE INTO WS-ITEM(WS-COUNT) 
           END-PERFORM. 
           DISPLAY "DONE"